In [1]:
%load_ext sql

In [2]:
%sql sqlite:///library.db

'Connected: @library.db'

In [3]:
%%sql 
INSERT INTO PhysicalLibraryItems(AssetTag, Status, ShelfNumber)
	VALUES	(1,	'Checked Out',	4),
			(2,	'Checked Out',	3),
			(3,	'Checked Out',	2),
			(4,	'Checked Out',	5),
			(5,	'Checked Out',	5),
			(6,	'Checked Out',	6),
			(7,	'Checked Out',	7),
			(8,	'Checked Out',	5),
			(9,	'Checked Out',	53),
			(10,	'Checked Out',	23),
			(11,	'Reserved',	12),
			(12,	'Reserved',	61),
			(13,	'Available',	32),
			(14,	'Available',	6),
			(15,	'Available',	56),
			(16,	'Checked Out',	5),
			(17,	'Reserved',	33),
			(18,	'Reserved',	11),
			(19,	'Reserved',	3),
			(20,	'Reserved', 55);

* sqlite:///library.db
20 rows affected.

[]

In [4]:
%%sql
INSERT INTO Publications(AssetTag, Status, ShelfNumber, ISBN, Title, Genre, Author, Subject, Edition, Type, ContentRating, Publisher, DateOfPublication)
    VALUES  (1,	'Checked Out',	4,	8856105745028,	'The House',	                    'Fiction',	        'Robert Stewart',	NULL,	        1,	    'Book',	                NULL,	'Book Publisher Co.',	'2003-02-06'),
            (2,	'Checked Out',	3,	3217896471029,	'The Power of Habit',	            'Self Help',	    'Charles Duhigg',	NULL,	        1,	    'Book',	                NULL,	'Book Publisher Co.',	'2012-04-23'),
            (3,	'Checked Out',	2,	6593719756384,	'Coding for Toddlers',	            'Science-Fiction',  'John Smith',	    NULL,	        2,	    'Book',	                NULL,	'Some Publisher',	'2001-05-02'),
            (4,	'Checked Out',	5,	5670316635487,	'Databases for Dummies',            'Science',	        'Mike Williams',	NULL,	        7,	    'Book',	                NULL,	'A cool publisher',	'2015-08-05'),
            (5,	'Checked Out',	5,	9465720573824,	'People Magazine',	                'Lifestyle',	    'Meredith Tuck',	NULL,	        NULL,	'Magazine',	            'PG-13',	'A cool publisher',	'2017-01-06'),
            (6,	'Checked Out',	    6,	5708562857263,	'Food Network Magazine',            'Lifestyle',	    'Karen Jones',	    NULL,	        NULL,	'Magazine',	            'E',	'Some Publisher',	'2000-08-04'),
            (7,	'Checked Out',	7,	5748903485682,	'Forbes Mazagine',	                'Business',	        'Steve Forbes',	    NULL,	        NULL,	'Magazine',	            'E',	'A cool publisher',	'2019-07-23'),
            (8,	'Checked Out',	    5,	3856002475627,	'Establishing a Database',	        'Science',	        'Joseph Michaels',	'Engineering',	NULL,	'Scientific Journal',	NULL,	'Book Publisher Co.',	'2014-09-03'),
            (9,	'Checked Out',	    53,	3967164057235,	'Architecture Solutions for SaaS',  'Science',	        'Thomas Right',	    'Engineering',	NULL,	'Scientific Journal',	NULL,	'Some Publisher',	'2010-11-24'),
            (10,'Checked Out',	23,	9265816563198,	'How to make a database', 	        'Science',	        'Jessica White',	'Engineering',	NULL,	'Scientific Journal',	NULL,	'Book Publisher Co.',	'2018-10-03');

* sqlite:///library.db
10 rows affected.

[]

In [5]:
%%sql
INSERT INTO Media(AssetTag, Status, ShelfNumber, Title, YearReleased, Genre, ProductionStudio, Artist, Length, NumTracks, Rating, Type)
    VALUES  (11,	'Reserved',	    12,	'A.I. Artificial Intelligence',	'2001',	'Sci-Fi',	'Cool Productions', 	NULL,	            6, 	NULL,	        'PG-13',	'DVD'),
            (12,	'Reserved', 	61,	'The Abyss',	                '1989',	'Adventure',	'Disney',	        NULL,	            1,	NULL,	        'PG-13',	'DVD'),
            (13,	'Available',	32,	'Adaption',	                    '2002',	'Comedy',	'Haha Production',	    NULL,	            21,	NULL,	        'R',	'DVD'),
            (14,	'Available',	6,	'Dangerous Woman',	            '2019',	'Romance',	'Grande Productions',	'Ariana Grande',	4,	    23, 	'E',	'CD'),
            (15,	'Available',	56,	'Dangerous Man',	            '2020',	'Comedy',	'Haha Productions',	    'Jonas Brothers',	4,      4,	    'E',	'CD'),
            (16,    'Checked Out',	5,	'An old record',	            '1518',	'Blues',	'BC Productions',	    'Blues Clues',	    2,	     4,       'PG-13',	'Record'),
            (17,	'Reserved', 	33,	'No one will listen',       	'1990',	'Metal',	'Sick Beats Productions',	'Sick Tunes',	4,	     4,  'M',	'Record'),
            (18,	'Reserved',	    11,	'Animal Crossing: New Horizons', '2019','Entertainment',	'Nintendo',	    NULL,	            NULL,	NULL,	'E',	'VideoGame'),
            (19,	'Reserved',	    3,	'Lets Go Pokemon',	            '2018',	'Entertainment',	'GameFreak',    NULL,	            NULL,	NULL,	'E',	'VideoGame'),
            (20,	'Reserved',	    55,	'Mario Kart',	                '2018',	'Entertainment',	'Nintendo',	    NULL,	            NULL,	NULL,	'E',	'VideoGame');

* sqlite:///library.db
10 rows affected.

[]

In [6]:
%%sql 
INSERT INTO OnlineBooks(ISBN, Title, DateOfPublication, Genre, Link, Publisher, Author)
    VALUES  (8856105745028,	'The House',	'2003-02-06',	'Fiction',	'http://onlinebook0.library',	'Book Publisher Co.',	'Robert Stewart'),
            (3217896471029,	'The Power of Habit',	'2012-04-23',	'Self Help',	'http://onlinebook1.library	', 'Book Publisher Co.',	'Charles Duhigg'),
            (6593719756384,	'Coding for Toddlers',	'2001-05-02',	'Science-Fiction',	'http://onlinebook2.library',	'Some Publisher',	'John Smith'),
            (5670316635487,	'Databases for Dummies',	'2015-08-05',	'Science',	'http://onlinebook3.library',	'A cool publisher',	'Mike Williams'),
            (9465720573824,	'People Magazine',	'2017-01-06',	'Lifestyle',	'http://onlinebook4.library',	'A cool publisher',	'Meredith Tuck'),
            (5708562857263,	'Food Network Magazine',	'2000-08-04',	'Lifestyle',	'http://onlinebook5.library',	'Some Publisher',	'Karen Jones'),
            (5748903485682,	'Forbes Mazagine',	'2019-07-23',	'Business',	'http://onlinebook6.library',	'A cool publisher',	'Steve Forbes'),
            (3856002475627,	'Establishing a Database',	'2014-09-03',	'Science',	'http://onlinebook7.library',	'Book Publisher Co.',	'Joseph Michaels'),
            (3967164057235,	'Architecture Solutions for SaaS',	'2010-11-24',	'Science',	'http://onlinebook8.library',	'Some Publisher',	'Thomas Right'),
            (9265816563198,	'How to make a database',	'2018-10-03',	'Science',	'http://onlinebook9.library',	'Book Publisher Co.',	'Jessica White');

* sqlite:///library.db
10 rows affected.

[]

In [7]:
%%sql

INSERT INTO LibraryEvents(EventName, DateOfEvent, Fee, Location, RecommendedAge, Type)
    Values('Magic Show','2020-05-02', 2.50, 'Library Room 1', 12, 'Magic'),
        ('Book Club','2020-03-21', 0, 'Library Room 2', 6, 'Reading'),
        ('Science Book Club','2020-06-02', 0, 'Library Room 1', 13, 'Reading'),
        ('Science Show','2020-10-02', 1.50, 'Library Room 3', 14, 'Science Show'),
        ('Adult Book Club','2020-11-13', 0, 'Library Room 4', 20, 'Reading'),
        ('Elvis Presley Listening','2020-04-20', 0.50, 'Library Room 1', 30, 'Music'),
        ('Rock Show','2020-11-15', 10, 'Main Hall', 18, 'Concert'),
        ('Motivational Speech','2020-09-09', 5.00, 'Library Room 3', 18, 'Motivation'),
        ('AA','2020-05-02', 0, 'Library Room 2', 21, 'Support'),
        ('Corona Virus Aid','2020-08-18', 10, 'Library Room 2', 21, 'Charity');

* sqlite:///library.db
10 rows affected.

[]

In [8]:
%%sql 

INSERT INTO LibraryEmployees(SIN, FirstName, LastName, Address, Email, DateOfBirth, Salary, PhoneNumber)
    Values('123456789', 'Sam', 'Rock', '31 Homer Street', 'SamRock@gmail.com', '1996-03-28', 12000, '604-318-8989'),
          ('333456789', 'Dylan', 'Hope', '213 Tehran Street', 'DylanHope@gmail.com', '1966-01-08', 29000, '604-333-4444'),
          ('999999999', 'Lucifer', 'Hell', '666 Hear Place', 'Devil@yahoo.com', '1926-12-04', 60000, '604-666-4321'),
          ('333444556', 'Potato', 'Seebzamini', '22 French Fry Street', 'Salty@hotmail.com', '2000-10-31', 30000, '604-604-6041'),
          ('420420678', 'Manly', 'Pebble', '314 Marine Drive', 'Wish2Rock@gmail.com', '1999-09-09', 42000, '604-331-4141'),
          ('181818989', 'Farbod', 'Shah', '31 Cordova Street', 'Fshah@Outlook.com', '1998-02-18', 82000, '604-313-9000'),
          ('465465890', 'Nima', 'Tiktok', '89 Crystal Street', 'Nimarocks@gmail.com', '1998-09-11', 89430, '604-218-3366'),
          ('890098414', 'Armin', 'Bug', '549 Greenleaf Rd', 'Amazin31@gmail.com', '1999-01-01', 32000, '778-123-6890'),
          ('010101020', 'Mouse', 'Potter', '00 Hogwarts Street', 'MagicRules@gmail.com', '2002-01-31', 56400, '604-118-9000'),
          ('222222222', 'Ralzanda', 'Mickey', '218 Halfway Street', 'MickeyWannabe@gmail.com', '1991-02-02', 13000, '604-338-8909');

* sqlite:///library.db
10 rows affected.

[]

In [9]:
%%sql


INSERT INTO FutureItems(ItemName, Type)
    Values('Harry Potter 1', 'Book'),
          ('Fifa 2020', 'VideoGame'),
          ('Hustle', 'DVD'),
          ('Research into Pandemics', 'Scientific Journal'),
          ('Thomas the Engine', 'Book'),
          ('Frank Sinatra', 'Record'),
          ('Love is Blind', 'Dvd'),
          ('Vogue: Quarantine Fasion', 'Magazine'),
          ('SQL Databases', 'Book'),
          ('Fashion History', 'Magazine'),
          ('National Geographic', 'Magazine'),
          ('NBA2k20','VideoGame'),
          ('Charlie and the Chocolate Factory','Dvd'),
          ('One Less Lonley Girl','CD'),
          ('Never say never','CD'),
          ('Once he saw her he never saw again', 'Book');

* sqlite:///library.db
16 rows affected.

[]

In [10]:
%%sql 
    
INSERT INTO DonatedBy(CardNumber, DonerFirstName, DonerLastName, ItemName)
    Values(1, 'Steve', 'Lighvan', 'Harry Potter 1'),
          (2, 'Curtis', 'Lit', 'Fifa 2020'),
          (3, 'Soroush', 'Salami', 'Hustle'),
          (4, 'Sina', 'Chak','Research into Pandemics'),
          (5, 'Bebo', 'Bobandis', 'Thomas the Engine'),
          (6, 'Chris', 'Money', 'Frank Sinatra'),
          (7, 'Tony', 'Rock', 'Love is Blind'),
          (8, 'Tanya', 'Chicken', 'Vogue: Quarantine Fasion'),
          (9, 'Turkey', 'Alta', 'SQL Databases'),
          (10, 'Corona', 'Salamander', 'Fashion History');

* sqlite:///library.db
10 rows affected.

[]

In [11]:
%%sql 

INSERT INTO Working(EventName, DateOfEvent, SIN, FirstName, LastName)
    Values('Magic Show','2020-05-02','123456789', 'Sam', 'Rock'),
          ('Book Club','2020-03-21', '333456789', 'Dylan', 'Hope'),
          ('Science Book Club','2020-06-02','999999999', 'Lucifer', 'Hell'),
          ('Science Show','2020-10-02','333444556', 'Potato', 'Seebzamini'),
          ('Adult Book Club','2020-11-13','420420678', 'Manly', 'Pebble'),
          ('Elvis Presley Listening','2020-04-20','181818989', 'Farbod', 'Shah'),
          ('Rock Show','2020-11-15','465465890', 'Nima', 'Tiktok'),
          ('Motivational Speech','2020-09-09','890098414', 'Armin', 'Bug'),
          ('AA','2020-05-02','010101020', 'Mouse', 'Potter'),
          ('Corona Virus Aid','2020-08-18', '222222222', 'Ralzanda', 'Mickey');

* sqlite:///library.db
10 rows affected.

[]

In [12]:
%%sql 
    
INSERT INTO Attending(EventName, DateOfEvent, CardNumber, FirstName, LastName)
    Values('Magic Show','2020-05-02',1, 'Steve', 'Lighvan'),
          ('Magic Show','2020-05-02',2, 'Curtis', 'Lit'),
          ('Magic Show','2020-05-02',4, 'Sina', 'Chak'),
          ('Magic Show','2020-05-02',5, 'Bebo', 'Bobandis'),
          ('Magic Show','2020-05-02',11, 'Bud', 'Zaviar'),
          ('Science Book Club', '2020-06-02',1, 'Steve', 'Lighvan'),
          ('Adult Book Club', '2020-11-13',2, 'Curtis', 'Lit'),
          ('Elvis Presley Listening', '2020-04-20', 4, 'Sina', 'Chak'),
          ('AA','2020-05-02',5, 'Bebo', 'Bobandis'),
          ('Corona Virus Aid','2020-08-18',11, 'Bud', 'Zaviar');

* sqlite:///library.db
10 rows affected.

[]

In [13]:
%%sql
INSERT INTO BorrowedBy (AssetTag, CardNumber, DateBorrowed, DateDue, DateReturned)
    VALUES  (1,	1,	'2019-01-02',	NULL,	NULL),
            (2,	2,	'2020-02-22',	NULL,	NULL),
            (3,	3,	'2020-03-20',	NULL,	NULL),
            (4,	4,	'2001-03-15',	NULL,	NULL),
            (5,	5,	'2001-03-16',	NULL,	NULL),
            (6,	6,	'1998-03-02',	NULL,	NULL),
            (7,	7,	'2020-04-01',	NULL,	NULL),
            (8,	8,	'2006-01-26',	NULL,	NULL),
            (9,	9,	'2003-01-29',	NULL,	NULL),
            (10, 10, '1998-12-26, NULL,	NULL);

* sqlite:///library.db
(sqlite3.OperationalError) unrecognized token: "'1998-12-26, NULL,	NULL);"
[SQL: INSERT INTO BorrowedBy (AssetTag, CardNumber, DateBorrowed, DateDue, DateReturned)
    VALUES  (1,	1,	'2019-01-02',	NULL,	NULL),
            (2,	2,	'2020-02-22',	NULL,	NULL),
            (3,	3,	'2020-03-20',	NULL,	NULL),
            (4,	4,	'2001-03-15',	NULL,	NULL),
            (5,	5,	'2001-03-16',	NULL,	NULL),
            (6,	6,	'1998-03-02',	NULL,	NULL),
            (7,	7,	'2020-04-01',	NULL,	NULL),
            (8,	8,	'2006-01-26',	NULL,	NULL),
            (9,	9,	'2003-01-29',	NULL,	NULL),
            (10, 10, '1998-12-26, NULL,	NULL);]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [14]:
%%sql 
    
INSERT INTO LibraryMembers(CardNumber, FirstName, LastName, Address, Email, DateOfBirth, PhoneNumber, Volunteer)
    Values(1, 'Steve', 'Lighvan', '123 street', 'SL@gmail.com', '1998-05-02', '6044441234', FALSE),
          (2, 'Curtis', 'Lit', '1234 street', 'CL@gmail.com', '1998-03-02', '6044444444', TRUE),
          (3, 'Soroush', 'Salami', '12 street', 'SS@gmail.com', '1992-05-02', '6041241234', TRUE),
          (4, 'Sina', 'Chak', '444 street', 'SC@gmail.com', '1940-01-02', '6043241234', FALSE),
          (5, 'Bebo', 'Bobandis', '666 street', 'BB@gmail.com', '1948-10-12', '6041243334', FALSE),
          (6, 'Chris', 'Money', '999 street', 'CM@gmail.com', '1938-09-31', '6044441111', FALSE),
          (7, 'Tony', 'Rock', '100 street', 'TR@gmail.com', '1988-09-25', '60444419999', FALSE),
          (8, 'Tanya', 'Chicken', '1 street', 'TC@gmail.com', '1928-07-32', '604444166666', True),
          (9, 'Turkey', 'Alta', '8989 street', 'TA@gmail.com', '1938-06-12', '6044441234', FALSE),
          (10, 'Corona', 'Salamander', '7979 street', 'CS@gmail.com', '2000-05-17', '6044414441234', FALSE),
          (11, 'Bud', 'Zaviar', '8008 street', 'BZ@gmail.com', '1960-01-30', '60444442144', True);

* sqlite:///library.db
11 rows affected.

[]

In [15]:
%%sql
INSERT INTO DueFines(CardNumber, FirstName, LastName, AssetTag, Amount)
    VALUES  (1, 'Steve', 'Lighvan', 1, NULL),
            (2, 'Curtis', 'Lit', 2, NULL),
            (3, 'Soroush', 'Salami', 3, NULL),
            (4, 'Sina', 'Chak', 4, NULL),
            (5, 'Bebo', 'Bobandis', 5, NULL),
            (6, 'Chris', 'Money', 6, NULL),
            (7, 'Tony', 'Rock', 7, NULL),
            (8, 'Tanya', 'Chicken', 8, NULL),
            (9, 'Turkey', 'Alta', 9, NULL),
            (10, 'Corona', 'Salamander', 10, NULL);

* sqlite:///library.db
10 rows affected.

[]